{"id": 13, "segment": ["train_set", "labeled"], "course": "cs1622", "lec": "lec13", "text": "ABI and Codegen\nCS 1622\nJarrett Billingsley\n\nClass Announcements\n● how's the project?\n● project 2 grades will be posted today!\n\n2\n\nApplication\nBinary Interfaces (ABIs)\n\n3\n\nLike API, but with a B instead of a P\n● the backend converts the concept of \"a program\" into something the\nCPU can actually execute - machine code.\n● an Application Binary Interface is a set of rules that sets the\nstandards for how machine code programs look and work.\no so, the ABI will guide how we actually generate the code.\nto make things more interesting,\n\"the\" ABI is probably composed\nof multiple layers of rules.\n\nthings can get very interesting at the\nboundaries between these layers...\n\nLanguage ABI\nOS ABI\nArchitectural ABI\n\n4\n\nThe lowest layer: the Architectural ABI\n● the designers of an ISA may define an ABI to go with it.\no as the designers, they may have included special features for e.g.\nmaking function calls faster if you use those features as intended.\n● these may be bare-bones, including rules on how to do function\ncalls and object file formats, and not much else.\nthese are widely used on embedded\ndevices where there is no OS - your\nprogram runs \"on the bare metal.\"\n\n5\n\nBut Operating Systems have opinions\n● the goal of an operating system is to control access to your\ncomputer's resources and make the programs share them.\n● so, the designers of OSes will define their own ABI which are much\nmore extensive, including rules for:\no how function calls work\n▪ this may be built on the architectural ABI, or it may be unique!\no how system calls work, to ask the OS to do things for you\no how asynchronous messages are delivered to running programs\no how executables and shared libraries are packaged\no how memory is laid out and where parts of your program exist\n● these are the kinds of ABIs most compilers are generating code for,\nmost of the time.\n\n6\n\nThe highest layer: your language's own ABI\n● HLLs can have features which are not accounted for by either the\narchitectural or OS ABIs, so they have to make their own rules.\n● this might include features like:\nexceptions!\n\ndynamic method dispatch!\n\ntry {\n...throw...\n} catch(...) {\n...\n} finally {\n...\n}\n\nString s = obj.toString();\n\nfunction closures!\nauto f = [&]() {\ncout << \"wheee!\\n\";\n};\n\nhowever, if you're not careful defining your language, different\ncompilers for the same language can use different ABIs...\n7\n\nWhen ABIs collide\n● let's say a language has no standardized ABI for method calls.\n● then, different compilers may have their own incompatible ways of\ngenerating code for method calls, leading to really nasty situations.\nthis program was compiled\nwith Compiler A.\n\nyou wrote a plugin in the same\nlanguage, but you used Compiler B.\n\nProgram\n\nPlugin\n\nplugin.getName()\n\nthe program tries to call a method in\nyour plugin, and... what happens?\n\nwho knows? it might silently fail, it might crash immediately, it\nmight corrupt the stack or heap in more subtle ways, etc.\n8\n\nBreak the rules, get a broken program.\n● if two pieces of code use different ABIs...\n● or if your compiler generates code that doesn't follow the ABI...\n● you lose all the nice abstraction guarantees of the HLL.\n● think back to when you were writing MIPS in 447.\no do you really want to deal with those kinds of bugs again?\n● C - or rather its ABI - has remained popular for decades. why?\no because it's super simple, meaning just about every OS and\ncompiler can follow it without much difficulty.\no with it, you can hook pieces of machine code together reliably.\n● but, its simplicity means it doesn't support advanced features...\no so it's up to you, as the language designer or compiler writer, to\ndecide how those features are implemented.\n● so! what goes into an ABI, anyway?\n9\n\nParts of an ABI\n\n10\n\nThe call stack\n● any ISA from the last 50 years or so will have provisions for a stack.\nStack\n16\n\n0\n48580372\n0\n0\n5\n\nit'll have, at the very least, a register that points to\nthe top of the stack... a stack pointer, if you will.\n(well, maybe it has two registers. we'll get to that.)\n\nsp it might have special instructions for pushing and\npopping things to this stack, or it might not.\npush eax\n\npop ecx\n\ncall func\n\nret\n\nthe ABI defines things like: the direction the stack\ngrows; the size of each item on the stack; stack\nalignment (if the stack pointer must move in\nmultiples of some number); and so on.\n11\n\nYou can't stack things up forever...\n● statistically, most programs never need more than a few megabytes\nof stack space, and most use far, far less than that.\n● since the OS makes all the programs share resources, it may only\nallocate something like 4-16 MB of memory for your program.\no this is allocated before your program starts; you don't have to do\nanything to get it.\n● and what happens if you push more than that on the stack?\no stack overflow! yay!\n● so, however we implement our language's ABI, it will have to work\nwithin this limit.\n\n12\n\nThe calling convention\n● this is the set of rules used to call and return from functions.\n● it defines things like:\nhow arguments are passed;\n\nhow the return\naddress is calculated\nand where it's stored;\n\nfn add(x: int, y: int): int {\nlet sum = x + y;\nprintln_i(sum);\nreturn sum;\n}\nhow values are returned;\n\nwhich CPU registers must be saved,\nand which can be used freely.\n\nra\n\nv0\n\ns0\nt0\n\na0\n\nf0\n\nfp\n13\n\nBorder conflicts\n● within your language, you can use any calling convention you like.\no as long as every function uses the same rules, it will work fine.\n● it's at the boundaries where things get tricky.\nYour Language\n\nmain\n\ninit\n\nOS API\n\nprompt\n\nread\n\nprintln\n\nwrite\n\nfunctions from outside your\nlanguage may use a different\nABI, so your code generator\nmust be very careful about it.\nit has to know what ABI each\nfunction uses, so it can use the\nright rules when calling them.\nor, we could punt it...\n14\n\nIf it hurts, don't do it\n● you could make it so you can't directly call functions from other\nlanguages/which use different ABIs.\n● Java does this.\no public static native int someExternalFunction();\no this function is not written in Java.\no instead, it's probably written in C++, and compiled into a plugin.\no that plugin is then loaded into the JVM when your program runs.\n● this provides a controlled boundary between \"the safe Java world\"\nand \"the scary non-Java world,\" and lets Java programs call functions\nthey would normally be unable to.\n● systems programming languages will give you a way to deal with\ncalling conventions yourself.\no but Java isn't a systems language, and there's no shame in saying\n\"hey, it's not my language's responsibility!\"\n15\n\nAnother kind of call, another calling convention\n● system calls are how your program asks the OS to do things on the\nprogram's behalf: I/O, resource management, even exiting...\no without syscalls, about all a program can do is make the CPU hot.\n● the ISA defines the system call (syscall) mechanism...\no which usually requires using a special instruction. (like syscall.)\no the OS will also define how values are passed into/out of them.\n● essentially this is just another calling convention, meaning we will\nrun into the same issues as before.\no if a language cannot use syscalls directly, it will have to rely on\ncode written in some other language to do so.\n● it feels like this interface between our language and the OS is\ngoing to have to be somewhat... substantial. so let's talk about it.\n\n16\n\nStandard and\nRuntime Libraries\n\n17\n\nstd::\n● you kind of take the standard library (stdlib) for granted.\no there are these functions and classes that are just... there!\no System.out.println() and ArrayList and Vec and so on.\no but someone had to write them. and if you're making your own\nlanguage, that \"someone\" is going to be you.\n● standard libraries are out of the scope of this course, but...\no the standard library is going to have to make calls to OS APIs to do\nthings like input and output, somehow.\n● and all code in your language will rely on some special hidden code\nto work properly at runtime.\no and the compiler will be relying on that code as well!\n\n18\n\ncore::\n● there are likely many operations in your HLL that don't map neatly\nonto a few instructions in the target ISA.\nis there a MIPS instruction\nfor string concatenation?\n\nhow about for allocating\nobjects on the heap?\n\n\"hi\" + \"bye\"\n\nnew Cat()\n\nchecking array bounds?\n\nthrowing exceptions?\n\nA[1000000000]\n\nthrow new OhMyGodWhyAreAllTheExcept\nionNamesSoLongException();\n\nthere are a lot of hidden operations going on in each of these\ncases, and it is the runtime library which implements them.\n19\n\nThe language runtime\n● a language's runtime library implements the features which would\nbe difficult or impossible to codegen directly.\n● unlike the standard library, this is tied more closely to the compiler\nand how the compiler has decided to implement those features.\no so, different compilers - and even different versions of the same\ncompiler - can have different runtime libraries.\no ever install the many versions of Visual C++ Redistributable?\n▪ thaaaaat's what it iiiiiiiis\n● the runtime may be written in a different language (like C or C++)\nfrom the source language that the compiler compiles.\no in our case, Truss's tiny runtime library is written in MIPS. (so is its\n\"standard library\" of a few print functions, lol.)\n\n20\n\nThe compiler's job\n● during codegen, the compiler is essentially going to turn some\npieces of code into function calls into the runtime library.\n● if we take string concatenation as an example:\nsource code: let msg = \"hello, \" + name;\ncodegen treats it as: let msg = rt$concat(\"hello, \", name);\ngets generated as: addi sp, sp, -8\nla\nsw\nlw\nsw\njal\nsw\n\nt0, STRLIT$3\nt0, 0(sp)\nt0, 0(fp)\nt0, 4(sp)\nrt$concat\nv0, -20(fp)\n\nfp? what's that??\n21\n\nTruss's MIPS ABI\n\n22\n\nKind of standard, kind of not\n● Truss's MIPS ABI is based on the standard MIPS ABI, but is more\nlimited in some ways in order to make the codegen simpler.\n● we're generating code for a slightly weird target, MARS, which:\no has no operating system\no has no executable format, only textual assembly as input\n● those aspects will also simplify our job!\n● a large part of the ABI is the calling convention, but first, we have to\nspecify...\n\n23\n\nMemory regions\n● there are three regions of memory.\nlet g1 = 10;\nlet g2 = \"world\";\n\nthe .data segment holds the global\nvariables and any string literals.\n\nfn main() {\nthe heap holds dynamicallyprintln_i(g1);\nallocated strings and structs\nlet msg = \"hi, \" + g2;\n(like new Cat()).\nprintln_s(msg);\n}\nthe heap could be managed with\nthe stack holds the\na tracing garbage collector, if this\nlocal variables.\nwere a real language. but our\nimplementation won't.\n24\n\nHow global variables are generated\n● int and bool globals become .word and .byte variables, respectively.\nlet ivar = 10;\nlet bvar = true;\n\nstrings are more subtle...\n\nlet svar = \"hi\";\n\n.data\nivar: .word 10\nbvar: .byte 1\n\n.data\nSTRLIT$0: .asciiz \"hi\"\nsvar: .word STRLIT$0\n\nbools are represented with\n1 for true and 0 for false.\n\nevery string literal in the program\ngets a uniquely-named STRLIT label;\nstring variables just point to strings.\n25\n\nRuntime data representation\n● to be thorough we have to define how every type in the language is\nrepresented at runtime. fortunately, Truss doesn't have many!\no we already saw int and bool on the previous slide.\n● strings, function pointers, and struct references are all reference\ntypes, meaning they are represented as a pointer, which is a word.\n● the data of a string is defined as zero-terminated ASCII, which is kind\nof a terrible string representation but is exactly what MARS wants, so.\n● the data of a struct is... well... we'll come back to structs. ;o\n\n26\n\nFunction calls\n● the caller has an easy time calling functions, but the protocol is a\nlittle different than you may remember from 447.\n● rather than using those a registers, all arguments are passed on the\nstack, in the same order they are written in the source.\nf(1, 2);\neach stack slot is 4 bytes, so 2\narguments requires 8 bytes.\naddi sp, sp, -8\nli\nt0, 1\nsw\nt0, 0(sp)\nli\nt0, 2\nsw\nt0, 4(sp)\njal f\n\nrecall this means 0 + sp.\nthe second argument is at 4 + sp;\nthe third at 8 + sp etc.\n27\n\nAfter the call completes...\n● return values come out in v0, like you learned before.\n● assuming glob is a global variable...\nglob = f(1);\n\naddi sp, sp, -4\nli\nt0, 1\nsw\nt0, 0(sp)\njal f\nsw\nv0, glob\n\nnotice: the caller changes sp before calling,\nbut it does not change it after. we say the\ncallee \"cleans the stack\" (as we'll see shortly)\n\nimportant: there is a line here. below this line,\nthe contents of the a, t, and v registers may\nbe different than they were before the jal.\n\nhowever, the contents of the s registers are\nguaranteed to be the same as before the jal.\n\n28\n\nStack Frames\n● every function in the program needs a stack frame: a way of storing\nall the arguments, variables, and saved registers on the stack.\n● let's look at a super simple function's stack frame first.\nfn simple(x: int) {\nprintln_i(x);\n}\nx\nra\n\nthere's the argument. it was pushed by the caller.\nwe're going to push ra, the return address register,\nso we won't lose our way back to the caller when\nwe call println_i.\nwhat about when we have local variables?\n29\n\nLocal variables\n● after pushing ra, we will then make space for the locals.\nfn more_complex(x: int) {\nx\nlet y = x + 10;\nra\nfor i in 0, y {\nprintln_i(i);\ni\n}\ny\n}\nevery local variable gets its own stack slot.\n\n12(sp)\n\n4(sp)\n0(sp)\n\nsince the stack pointer is pointing at the lowest slot, we\ncan access the locals and arguments with offsets from it.\nbut that's going to make things difficult for us\nwhen we want to actually call println_i...\n30\n\nShifting sands (animated)\n● let's say we're generating code for println_i(i).\nfn more_complex(x: int) {\nlet y = x + 10;\nfor i in 0, y {\nprintln_i(i);\n}\n}\nx\n\n12(sp)\n16(sp)\n\nra\ni\n\n4(sp)\n8(sp)\n\ny\n\n0(sp)\n4(sp)\n\n__\n\n0(sp)\n\nthe first thing we do is make\nroom for the argument.\naddi sp, sp, -4\nbut what does that do to\nthe offsets from sp??\n\nit's absolutely possible to keep track of\nthe \"virtual sp\" and adjust the offsets\naccordingly. but I don't waaaaanna\nwhat if we had a second stack pointer,\none that didn't move around?\n31\n\nThe Frame Pointer register\n● MIPS has a second register for just this purpose, called fp.\n● this will point sort of weirdly into the middle of the stack frame,\ngiving us a stationary reference point for accessing locals.\n● going back to the super simple function...\nfn simple(x: int) {\nprintln_i(x);\n}\n\nx\n\nfp\n\nfp\nra\n\nsp\n\nwe're going to push both fp and ra!\nfp points at the first argument, and\nsp still points at the top of the stack.\nand what about locals?\n32\n\nThe local problem, solved (animated)\n● you aren't restricted to positive offsets from the stack/frame pointers!\nfn more_complex(x: int) {\nlet y = x + 10;\nfor i in 0, y {\nprintln_i(i);\n}\n}\nsp\n\nx\n\n0(fp)\n\nfp\nra\ni\n\n-12(fp)\n\ny\n\n-16(fp)\n\n__\nnow, even when sp moves around during the\nfunction, the offsets from fp never change.\n\n33\n\nFunction Prologue\n● the function prologue is the code that sets up the stack frame,\nessentially switching stack frames from the caller to the callee.\n● it looks like this:\nsw\nfp, -4(sp) this pushes the caller's frame pointer, so we\ncan get it back later.\nsw\n\nra, -8(sp)\n\nmove fp, sp\naddi sp, sp, -n\n\nthis pushes the callee's return address.\n\nthis sets up the callee's frame pointer, so it\npoints to the first argument (if any).\nand finally, this sets up the callee's stack\npointer, so we have room for the locals.\n\nhere, n is the number of bytes needed for all the\nlocals, plus the two saved registers from above.\n34\n\nFunction Epilogue\n● finally, the epilogue does the opposite: it restores the stack and\nrequired registers to the way they were when the function began.\nlw\n\nra, -8(fp)\n\nthis restores our return address.\n\nlw\n\nfp, -4(fp)\n\nthis restores the caller's frame pointer.\n\naddi sp, sp, x\n\nthis completely cleans the stack, removing\nthe locals, saved regs, and all arguments.\n\njr\n\nand this returns!\n\nra\n\n35\n\nWhat about the juicy middles?\n● it seems like a lot of buildup to only a handful of instructions, but...\no this shit is important okay\no we have to do this right or else our program falls apart!!\n● but by setting up our stack frame neatly like this, it will make\ngenerating the code inside the functions a lot more straightforward.\no and that's what we'll talk about next time!\n\n36\n\n", "label": [[325, 353, "Concept"], [0, 3, "Concept"], [451, 454, "Concept"], [540, 543, "Concept"], [679, 682, "Concept"], [686, 689, "Concept"], [704, 707, "Concept"], [748, 751, "Concept"], [792, 795, "Concept"], [1375, 1378, "Concept"], [1498, 1501, "Concept"], [1892, 1895, "Concept"], [2433, 2436, "Concept"], [3085, 3088, "Concept"], [3283, 3286, "Concept"], [3707, 3710, "Concept"], [3735, 3738, "Concept"], [4167, 4170, "Concept"], [4852, 4855, "Concept"], [5631, 5634, "Concept"], [5710, 5713, "Concept"], [9723, 9726, "Concept"], [9777, 9780, "Concept"], [9811, 9814, "Concept"], [10104, 10107, "Concept"], [690, 707, "Concept"], [734, 751, "Concept"], [1484, 1501, "Concept"], [683, 689, "Concept"], [670, 682, "Concept"], [1224, 1240, "Concept"], [9962, 9978, "Concept"], [683, 685, "Concept"], [1123, 1125, "Concept"], [1560, 1562, "Concept"], [1980, 1982, "Concept"], [3382, 3384, "Concept"], [4523, 4525, "Concept"], [5536, 5538, "Concept"], [6663, 6665, "Concept"], [6947, 6949, "Concept"], [7290, 7292, "Concept"], [7824, 7826, "Concept"], [774, 777, "Concept"], [3765, 3768, "Concept"], [6820, 6823, "Concept"], [8152, 8155, "Concept"], [216, 223, "Concept"], [306, 318, "Concept"], [404, 416, "Concept"], [3471, 3483, "Concept"], [8, 15, "Concept"], [8654, 8661, "Concept"], [9300, 9307, "Concept"], [9507, 9514, "Concept"], [9870, 9877, "Concept"], [5644, 5658, "Concept"], [3748, 3758, "Concept"], [2896, 2901, "Concept"], [3753, 3758, "Concept"], [3825, 3830, "Concept"], [3832, 3837, "Concept"], [3932, 3937, "Concept"], [3943, 3948, "Concept"], [4104, 4109, "Concept"], [4210, 4215, "Concept"], [4252, 4257, "Concept"], [4259, 4264, "Concept"], [4283, 4288, "Concept"], [4362, 4367, "Concept"], [4460, 4465, "Concept"], [4780, 4785, "Concept"], [4789, 4794, "Concept"], [10505, 10510, "Concept"], [11849, 11854, "Concept"], [11920, 11925, "Concept"], [12437, 12442, "Concept"], [12704, 12709, "Concept"], [12757, 12762, "Concept"], [12844, 12849, "Concept"], [12893, 12898, "Concept"], [13366, 13371, "Concept"], [13410, 13415, "Concept"], [14089, 14094, "Concept"], [14284, 14289, "Concept"], [14565, 14570, "Concept"], [14689, 14694, "Concept"], [14996, 15001, "Concept"], [15031, 15036, "Concept"], [15392, 15397, "Concept"], [15620, 15625, "Concept"], [15848, 15853, "Concept"], [16159, 16164, "Concept"], [3943, 3956, "Concept"], [4283, 4296, "Concept"], [13410, 13423, "Concept"], [14089, 14102, "Concept"], [4027, 4029, "Concept"], [9591, 9593, "Concept"], [9595, 9597, "Concept"], [9641, 9643, "Concept"], [9661, 9663, "Concept"], [11981, 11983, "Concept"], [11985, 11987, "Concept"], [12010, 12012, "Concept"], [12032, 12034, "Concept"], [12065, 12067, "Concept"], [12099, 12101, "Concept"], [12120, 12122, "Concept"], [12276, 12278, "Concept"], [12280, 12282, "Concept"], [12305, 12307, "Concept"], [12355, 12357, "Concept"], [13382, 13384, "Concept"], [13389, 13391, "Concept"], [13395, 13397, "Concept"], [13773, 13775, "Concept"], [13780, 13782, "Concept"], [13793, 13795, "Concept"], [13799, 13801, "Concept"], [13809, 13811, "Concept"], [13815, 13817, "Concept"], [13826, 13828, "Concept"], [13889, 13891, "Concept"], [13893, 13895, "Concept"], [13942, 13944, "Concept"], [14003, 14005, "Concept"], [14454, 14456, "Concept"], [14531, 14533, "Concept"], [14787, 14789, "Concept"], [14849, 14851, "Concept"], [15107, 15109, "Concept"], [15191, 15193, "Concept"], [15205, 15207, "Concept"], [15213, 15215, "Concept"], [15217, 15219, "Concept"], [15810, 15812, "Concept"], [15814, 15816, "Concept"], [14141, 14154, "Concept"], [15136, 15149, "Concept"], [15293, 15306, "Concept"], [15789, 15802, "Concept"], [5298, 5300, "Concept"], [9651, 9653, "Concept"], [9683, 9685, "Concept"], [9688, 9690, "Concept"], [14223, 14225, "Concept"], [14443, 14445, "Concept"], [14447, 14449, "Concept"], [14483, 14485, "Concept"], [14494, 14496, "Concept"], [14796, 14798, "Concept"], [14801, 14803, "Concept"], [14814, 14816, "Concept"], [14826, 14828, "Concept"], [14903, 14905, "Concept"], [15100, 15102, "Concept"], [15201, 15203, "Concept"], [15706, 15708, "Concept"], [15750, 15752, "Concept"], [15757, 15759, "Concept"], [13033, 13047, "Concept"], [15250, 15264, "Concept"], [15729, 15743, "Concept"], [5275, 5277, "Concept"], [12950, 12952, "Concept"], [13025, 13027, "Concept"], [13203, 13205, "Concept"], [13291, 13293, "Concept"], [13785, 13787, "Concept"], [14450, 14452, "Concept"], [14490, 14492, "Concept"], [14804, 14806, "Concept"], [15184, 15186, "Concept"], [15699, 15701, "Concept"], [15931, 15933, "Concept"], [4906, 4924, "Concept"], [5362, 5380, "Concept"], [6599, 6617, "Concept"], [7042, 7060, "Concept"], [10115, 10133, "Concept"], [11664, 11670, "Concept"], [12340, 12346, "Concept"], [12997, 13003, "Concept"], [13095, 13101, "Concept"], [15053, 15059, "Concept"], [15127, 15133, "Concept"], [15780, 15786, "Concept"], [12418, 12424, "Concept"], [15067, 15073, "Concept"], [15241, 15247, "Concept"], [15284, 15290, "Concept"], [15383, 15389, "Concept"], [12757, 12768, "Concept"], [12893, 12904, "Concept"], [14284, 14295, "Concept"], [14996, 15007, "Concept"], [16159, 16170, "Concept"], [10558, 10573, "Concept"], [13150, 13165, "Concept"], [13171, 13186, "Concept"], [4789, 4803, "Concept"], [6836, 6847, "Concept"], [6849, 6856, "Concept"], [6931, 6938, "Concept"], [5536, 5542, "Concept"], [7435, 7451, "Concept"], [7773, 7789, "Concept"], [8685, 8701, "Concept"], [9217, 9233, "Concept"], [7453, 7459, "Concept"], [8493, 8508, "Concept"], [8572, 8587, "Concept"], [9169, 9184, "Concept"], [9400, 9415, "Concept"], [8540, 8556, "Concept"], [2063, 2073, "Concept"], [8317, 8327, "Concept"], [2076, 2099, "Concept"], [2186, 2203, "Concept"], [2649, 2655, "Concept"], [2713, 2719, "Concept"], [2721, 2727, "Concept"], [2782, 2788, "Concept"], [6110, 6116, "Concept"], [6125, 6131, "Concept"], [6156, 6159, "Concept"], [10173, 10187, "Concept"], [10262, 10274, "Concept"], [2905, 2909, "Concept"], [8252, 8256, "Concept"], [10344, 10348, "Concept"], [10474, 10478, "Concept"], [10635, 10651, "Concept"], [10965, 10979, "Concept"], [3949, 3956, "Concept"], [4289, 4296, "Concept"], [11398, 11405, "Concept"], [13416, 13423, "Concept"], [14095, 14102, "Concept"], [14147, 14154, "Concept"], [15142, 15149, "Concept"], [15299, 15306, "Concept"], [15398, 15405, "Concept"], [15795, 15802, "Concept"], [10697, 10701, "Concept"], [10829, 10833, "Concept"], [10888, 10892, "Concept"], [11418, 11422, "Concept"], [11461, 11482, "Concept"], [3189, 3193, "Concept"], [8168, 8172, "Concept"], [9199, 9203, "Concept"], [9718, 9722, "Concept"], [9772, 9776, "Concept"], [9806, 9810, "Concept"], [14166, 14170, "Concept"], [9940, 9944, "Concept"], [11554, 11558, "Concept"], [9718, 9726, "Concept"], [9772, 9780, "Concept"], [9806, 9814, "Concept"], [9710, 9726, "Concept"], [9764, 9780, "Concept"], [9988, 10005, "Concept"], [1668, 1684, "Concept"], [1590, 1611, "Concept"], [12821, 12836, "Concept"], [15511, 15526, "Concept"]]}