{"id": 10, "segment": ["test_set", "labeled"], "course": "cs0449", "lec": "lec06", "text": "6\n\nMemory\nManagement\n\nCS/COE 0449\nIntroduction to\nSystems Software\n\nLuis Oliveira\n(with content borrowed from wilkie and Vinicius Petrucci)\n\n\fOur Story So Far\nYou Hear a Voice Whisper: “The Memory Layout is a Lie”\n\n2\n\n\fReallocating our thoughts\n• A program has several sections:\n• Code\n• Static data\n• Stack\n• Heap\n\n• Today, we take a deeper dive at how dynamic\nmemory is allocated in the heap.\n\nPotential Layout\n(32-bit addresses)\n\nstack\ncurrently unused but\navailable memory\n\nheap\nstatic data\n\ncode\n3\n\n\fReallocating our thoughts\n• We have looked at\n\nand\n\n.\n\n• They stake out space in the heap and return an\naddress.\n• Right now, we live in a nice ideal world.\n• No other programs are running.\n• We have access to all of the memory.\n• Muhahahaha!!\n\n• The OS is lying to our program.\n• This memory is… virtual... reality.\n• We will investigate this lie later in the course.\n\nPotential Layout\n(32-bit addresses)\n\nstack\ncurrently unused but\navailable memory\n\nheap\nstatic data\n\ncode\n4\n\n\fThe World of Allocation\nIt is a puzzle without any optimal solution. Welcome to computers!\n\n5\n\n\fA heap of possibilities\n• Stack access often does not deviate much.\n\nPotential Layout\n(32-bit addresses)\n\n• We allocate a little bit at a time.\n• We allocate and free the memory VERY often.\n\nstack\n• Heap allocations have many access patterns that are\npossible.\n• You might allocate a lot at a time and keep it around for a\nlong time. Or a short time.\n• You might allocate a lot of small things, instead.\n• Maybe you do a little bit of everything?\n\n• Often, such patterns are not easy to predict.\n• Do you get a big file as input? A small file?\n\ncurrently unused but\navailable memory\n\nheap\nstatic data\n\ncode\n6\n\n\fA heaping helping of good luck\n• Allocations could happen in a nice order.\n• When something is allocated, it can be allocated\nafter everything else.\n\nstack\n\navailable memory\navailable memory\navailable memory\n\n• When freed, it makes room for new things.\n\n• IF ONLY.\n• I mean, it’s possible… but like…\n• the heap and stack are different things for a reason.\n\nheap\nstatic data\ncode\n7\n\n\fDigital potholes… as annoying as real ones\n• Small allocations interfere with large ones.\n• When small gaps interfere with allocation, this is\ncalled fragmentation.\n\nstack\navailable memory\navailable memory\navailable\navailable memory\nmemory\navailable memory\n\nNext\nAllocation\n\nUgh\n\n?\nif we had omniscience of future\nallocations, we could avoid this…\nbut we can’t know ahead of time!\n\nheap\nstatic data\ncode\n8\n\n\fThe worst case\nstack\n\n• When you allocate a lot of small things…\n• Free every other one…\n• And then attempt to allocate a bigger thing…\n\n• Even though there is technically enough memory…\n• There is no continuous space.\n• Therefore, our naïve\nwill fail.\n\n• We have to come up with some strategy.\n\n???\n\nheap\nstatic data\ncode\n9\n\n\fMoving is never easy\nstack\n\n• Why not move things around??\n• A defragmentation process/algorithm\n\n• Moving around something in the heap is hard!\n• Any pointers referring to data within a block must be updated.\n• Finding these pointers automatically is effectively as difficult\nas garbage collection.\n\n• Because of this, moving blocks around is discouraged.\n(Easier to solve it another way.)\n???\n\nheap\nstatic data\ncode\n10\n\n\fMoving is NEVER easy\nstack\navailable memory\n\n• When blocks move, pointers\nto anything within them must be updated.\n• This is hard to keep track of!\n• C does not check validity of pointers after\n\nheap\nstatic data\ncode\n11\n\n\fStressing it out\n• If we allocate a large array it will be allocated on the\nheap somewhere.\n• Other allocations can also happen, and they go “above”\nthat array.\n\nstack\n\navailable memory\n\nint arr[200]\n\n• What happens when you need to append a 101st\nelement to this array?\n• Uh oh!\nold\ndata:\nint arr[100]\nint\narr[100]\n\n• You will need to allocate more space.\n• And then copy the array contents.\n• Free the old array.\n• How long does that take?\n\nfragmentation\n\nheap\n12\n\n\fStressing it out: Big Arrays\n• This happens in very practical situations!\n• Reallocating means getting rid of a small thing\n• And replacing it with a larger thing.\n• You could have TiBs of memory and this will be a problem.\n\nstack\n\navailable memory\n\n• This affects performance: (in terms of writes:)\n• Appending item arr[0]: 𝑂 1\n• Appending item arr[1]: 𝑂 1\n• …\n• Appending item arr[99]: 𝑂 1\n• Appending item arr[100]: 𝑂 𝑛 + 1 oh no!\n\n• When you would overflow the buffer…\n• You then need to copy all previous values as well.\n\nold\ndata:\nint arr[100]\nint\narr[100]\n\nheap\n13\n\n\fStressing it out: Performance Consistency\n• Big arrays want to be continuous.\n• Ensuring continuous space is difficult when you do not know\nhow much you will ultimately need.\n\n• This is exactly why linked lists exist!\n\nstack\n\navailable memory\n\n• Since a linked list allocates on every append.\n• Each append takes the same amount of time.\n\n• However, everything is a trade-off.\n• Dang it!!!\n• One cost is extra overhead for metadata.\n• Linked list traversal can stress memory caches.\n• It means traversing the array is slower.\n• However, we will mostly ignore this for now.\n\nold\ndata:\nint arr[100]\nint\narr[100]\n\nheap\n14\n\n\fThe Linked List\nA story about trade-offs.\n\n15\n\n\fWhat is a linked list?\n• A linked list is a non-continuous data structure representing an ordered list.\n• Each item in the linked list is represented by metadata called a node.\n• This metadata indirectly refers to the actual data.\n• Furthermore, it indirectly refers to at least one other item in the list.\n\nNode\n\n“struct” required since\nNode is not technically\ndefined until after it is\ndefined!\n\n16\n\n\fKeeping ahead of the list.\n• Creation of a list occurs when one allocates a single node and tracks it in a\npointer. This is the head of our list (first element.)\n\nNode\n\n17\n\n\fAdding some links to our chain\n• If we want to append an item, we can add a node anywhere!\n\n“tail”\n\n“node”\n\nRemember the\n‘\\0’ sentinel!\n\n18\n\n\fWe can add them anywhere!!\n• Consider what happens if we update our append to take any Node:\n\n“curNode”\n\n“node”\n\nTail\n\n19\n\n\fWe can add them anywhere!!\n• This function has very consistent performance (constant time):\n\n• The append always allocates the same amount.\n• It always copies the same amount.\n• Compare to a big array where you may have to copy the entire thing to\nappend something new!\n\n\fTraversal… on the other hand…\n• Accessing an array element is generally very simple.\n•\nis the same as\nbecause its location is very well-known!\n• This is because array items are continuous in memory. Not true for linked lists!\n\n• Here is a function that performs the equivalent for linked lists:\n\nQ: How many times is memory accessed relative to the requested index?\n\n21\n\n\fRemoving… on the other, other hand!\n• One nice thing about linked lists\nis their flexibility to changing\nshape.\n• I used to be able to bend a lot\nbetter, too, when I was in my 20s.\nAlas.\nCan’t find item at index.\nWe are deleting the head.\n\n• Since we don’t have a way to go\n“backward”\n• We first find the node we want to\ndelete (\n)\n• Keeping track of the node of\n– (\n)\n• Rewire\nto cut out\n.\n\nReturns new head (or old head if unchanged).\n\n22\n\n\fRemoving… on the other, other hand!\n• This looks complex, but it really is\na simple traversal.\n• So it takes 𝑂 𝑛 to find the item.\n• And it performs a simple update\nand deallocation. (quick to do)\n\n• A big array, on the other hand.\n• It can find the element to remove\nimmediately.\n• However, removing it means\nshifting over every item after it left.\n• That can be an expensive update!\n(Memory is slow!!)\n23\n\n\fOn your own!\n\nThink about the code you would need to do any of the following:\n• Delete/free the entire linked list.\n• Sort a linked list.\n• Append a linked list to an existing one.\n• Copy a subset of a linked list to a new list.\nOften, operations can be abstracted in such a way that all of these can be written relatively\nsimply.\nConsider the performance of these operations compared to an Array.\n24\n\n\fLinked lists … link you … to the world!\n• Consider how much cleaner you can make certain operations if you tracked the\nprevious node as well.\n• This is a doubly linked list.\n• This is typically “double-ended” as well: keeping track of both head and tail.\n\nNode\n\nNode\n\nNode\n\n25\n\n\fSeeing the trees through the forest\n• A binary tree can be represented by the same nodes as a linked list.\n• In this case, you have a left and right child node instead of next and prev.\nNode\n\n• The operations are\nvery different, though.\n\nNode\n\nNode\n\nNode\n\n26\n\n\fDe-Stressing it out: Linked Lists\n• We know big arrays want to be continuous.\n• However, ensuring continuous space is difficult when you do\nnot know how much you will ultimately need.\n\n• Linked lists allocate very small chunks of metadata.\n• These chunks can be allocated easily on-demand.\n• And then deallocated without creating wide gaps.\n\nstack\n\navailable memory\n\n• This reduces fragmentation.\n• Deallocating always leaves a small amount of room.\n• It is always the exact amount needed to append!\n• However, it is all at the expense of complexity!\n• And traversal can be expensive (but we can find ways to deal\nwith that.)\n\nsome other data\n\nheap\n27\n\n\fImplementing Malloc\nIt really sounds like some kind of He-Man or She-Ra villain of the week.\n\n28\n\n\fThe malloc essentials\n• The\nfollowing:\n\nstack\n\nfunction does the\n\n• Allocates memory of at least\nbytes.\n• Returns the address to that block of memory (or\nerror)\n\non\n\navailable memory\n\n• Essentially, your program has a potentially large chunk of\nmemory.\n• The\nfunction tears off a piece of the chunk.\n• Also\nmust then allow that chunk to be reused.\n• The job of\nis to do so in the “best” way to reduce\nfragmentation.\nWe want to avoid fragmentation\n29\n\n\fChoosing where to allocate\n• Our first problem is, when\nwe tear off a chunk?\n\nis called, where do\n\n• We can do a few simple things:\n• First-Fit: start at lowest address, find first available section.\n\nstack\navailable memory\n\n• Fast, but small blocks clog up the works.\n\n• Next-fit: Do “First-Fit” but start where we last allocated.\n• Fast and spreads small blocks around a little better.\n\n• Best-Fit: laboriously look for the smallest available section to\ndivide up.\n\nLast Allocated\n\n• Slow, but limits fragmentation.\n\n???\n30\n\n\fManaging that metadata!\n• You have a whole section of memory to divide up.\n• You need to keep track of what is allocated and what is free.\n• One of the least complicated ways of doing so is to use… hmm…\n• A linked list! (or two!) We know how to do this!!\n\n• We can treat each allocated block (and each empty space) as a node in a linked\nlist.\n• Allocating memory is just appending a node to our list.\n\n• The trick is to think about how we want to split up the nodes representing\navailable memory.\n\n31\n\n\fTracking memory: Our fresh new world.\n• Let’s orient our memory visually horizontally.\n• We have control over EVERY byte of it. We can place metadata ANYWHERE.\n\n• Every\n\nis responsible for allocating a block of memory.\n\n• How, then, do we manage where things are allocated and where is empty space?\n• We can have “allocation” reduce to creating a new node in a linked list.\n\navailable memory\n\nWe have the power to write data ANYWHERE!\nSo where do linked list nodes go?\n\n32\n\n\fLinked lists are our friend, here\n• We will augment our normal doubly linked list to be useful for tracking the size of\nthe block it represents. (an explicit list allocator)\n• Here, we will maintain a single linked lists of all allocated or free blocks.\n• The size field denotes how big the block is (how much is used/available.)\n• We need to know when a block represents allocated space or if it is free.\n• Hmm… we could use a single bit to denote that. Or… negativity!\n• The\n\nis NEVER\n\n. In fact,\n\nfails when requesting size of\n\n.\n\nAllocNode\n\nWe can make other clever\nspace optimizations, but we\nwill start with this.\n\nSigned! Negative number\nmeans a free block.\n\n33\n\n\fTracking memory: High level metadata\n• We can keep track of used/empty spaces cheaply by having linked list nodes\nat the beginning of them. The nodes track the size of the space.\n• Here we have an allocated block followed by a free and then allocated block.\n• The metadata for the linked list is just smashed into the block itself.\n\navailable memory\n\nQ: What happens when we write over the block boundary?\n\n34\n\n\fImplementing\n• To allocate some amount of space, we find a free block that is at least that\nsize + metadata size. (Which one? Well, first-fit and friends apply!)\n• Then we will want to split that free block.\nx\n\nx\n\nx\n\navailable memory\n\n35\n\n\fImplementing\nCarefully negate size\n\n• Allocating means finding a free\nblock big enough.\n• Including the metadata size.\n\n• Then splitting it into a used block\nand a smaller free block.\nLinked list traversal; 𝑂(𝑛)\n\n• This is incomplete. (Why?)\n\nLinked list append; 𝑂(1)\n\n• (you don’t always split)\n\nRecall that we made size\nnegative for a free block.\nPositive means non-free.\nis negative.\nThink about it!\nQ: This is first-fit. What should be added to implement next-fit? Best-fit?\n36\n\n\fImplementing\n• When freeing the middle block, you will create empty space.\n• Consider allocations… it’s somewhat difficult to see the empty space.\n• You have “false fragmentation,” so you will want to merge adjacent free blocks.\n\navailable memory\n\n37\n\n\fImplementing\n• So, when we free blocks, we look to the left. We look to the right.\n• We coalesce the newly free block with ANY adjacent free blocks.\n• First one…\n• Then the other. (And it is linked list node removal; a constant time operation!)\n\navailable memory\n\n38\n\n\fImplementing\nHeader is just before ptr\n\n• Finding the header metadata\nnode is simple.\n• Look at our\n\n•\n\n’s\n\n.\n\nis slightly less complex.\n• It does not have to search.\n\n• Where\n•\n\nResembles linked list\ndelete; 𝑂(1)\n\nsplits nodes\nmerges them.\n\n• Whenever a block is freed next\nto an existing one…\n• It should merge them!\n\nHowever it subtracts from size\n(which makes reflect a larger space)\n\n• Consider how much a doubly\nlinked list helped.\nQ: Are any changes required here for best-fit?\n\n39\n\n\fThinking about next-fit\n\n• With a typical first-fit version of the malloc function…\n• We can now consider simple improvements.\n• Traversing the list is expensive! 𝑂 𝑛 !\n\n• Next-fit helps because we start from the last allocated item.\n• Generally, what do you think comes after the last allocated item.\n• Consider the normal operation…\n• It splits the node and creates free space.\n\n• Therefore, seems likely free space will exist near the last allocation.\n• Perhaps causing the average case for malloc to bias itself toward 𝑂(1)\n• However, all strategies have their own worst-case!!\n• Think about what that might be.\n\n40\n\n\fThinking about best-fit\n• Best-fit, on the other hand, is not about avoiding traversal.\n• Instead, we focus on fragmentation.\n\n• Allocating anywhere means worst-case behavior splits nodes poorly.\n• If we find a PERFECT fit, we remove fragmentation.\n\n• Traversal is still bad… and we brute force the search...\n• But, hey, solve one problem, cause another. That’s systems!\n• Fragmentation may indeed be a major issue on small memory systems.\n\n• What is the best of both worlds? Next-fit + Best-fit?\n• Hmm.\n• Works best if you keep large areas open.\nCS/COE 0449 – Spring 2019/2020\n\n41\n\n\fOther thoughts\n• Don’t need\npointers since adding size to the block’s address will also\nmove there. (unusually, the linked list is always ordered!)\n• You don’t need to keep the used blocks in the list.\n• More complex to understand but removes implementation complexity.\n• Free nodes point to the next and previous free nodes. Used nodes point to their\nneighbors. Traversal is improved since it only visits free nodes; still 𝑂(𝑛)\n\n• The idea is to only keep track of necessary metadata.\n• You only coalesce when free blocks are adjacent.\n• With a list of only free blocks, you can easily tell when that condition is met…\n• just see if\n\nis the same address as\n\n• The only other concern is getting from a used block you want to free to its\nneighboring free block. So those have normal pointers.\n\n42\n\n\fExplicit free lists: giving you VIP access\n• When you allocate, you go through the free list.\n• You don’t care about allocated nodes.\n\n• When you free, you only care about coalescing neighbors.\n\navailable memory\n\nQ: Do free nodes need a\n\npointer?\n\n43\n\n\fTrees are your buddy\n\n• Recall that we easily took the ideas around linked lists and made binary trees.\n• You can manage memory with a binary tree as well.\n\n• This is called a buddy allocator.\n\n45\n\n\fDivide and conquer\n• Buddy allocators divide memory into halves that are powers of two.\n• Can cause internal fragmentation\n\n▪ The total memory,\n, is a\npower of two.\n▪ Each split is, then, also a\npower of two.\n\nAllocation is not a power of two: internal fragmentation\n\n46\n\n\fAllocating with trees\n• Assuming\n\nis\n\n, and we allocate 242MiB:\n\n• We travel left until we find a block\nthat fits.\n\n▪ We travel back up when we can’t go\nfurther left and go right.\n▪ When we find a\nunsplit node that\nfits, we allocate\nthere.\n\n47\n\n\fBurying the hatchet: Chopping the trees\n• Let’s allocate 64MiB. So nice, we will allocate it twice.\n• Again a depth-first search to find\nthe first unsplit node that fits us.\n\n▪ This node is fine! Allocate that!\n▪ Do it again!\n▪ When we find a\nunsplit node that is\ntoo big, we split in\nhalf and keep going.\n\nCS/COE 0449 – Spring 2019/2020\n\n48\n\n\fCoalescing friendships (animated)\n• Coalescing happens because every block has a buddy!\n• When both sides of a split node\nare free, coalesce them!\n\n▪ If this keeps happening, it will\ncoalesce larger spaces.\n▪ Repeating as\nmuch as\nnecessary.\n\nx\n\nx\n\nx\n49\n\n\fThinking like an arborist (but only if you are feeling listless)\n• How does a tree-based\nallocation system deal with\nfragmentation?\n• What are some immediate\ndrawbacks from using a\ntree scheme?\n\navailable\nmemory\n\n• Can you imagine a\npossibility of using a\nhybrid approach?\n50\n\n\fLies and Damned Lies!\n• Does your program actually own all of memory?\n• On modern systems, absolutely heckin not.\n\n• Your program still has to request memory allocations from the OS.\n• Generally,\ntakes on this responsibility behind the scenes.\n• In Linux, you request pages in the normal heap in LIFO order with\n• Or, you request specific virtual memory pages with\n.\n\n.\n\n• What is a segmentation fault.\n• Segments are the “code”, “data”, “heap” separation. You fault by doing something\nthe segment does not allow. (write to read-only memory)\n• A historic misnomer since we actually have paging, not segmented memory.\n\n• What is a “page”? Virtual memory??\n• It replaced segments and is part of the much grander lie about sharing memory\nwith multiple applications at the same time. More on this later!\n\n51\n\n\fI want to know MORE\n• If you find this topic interesting, it is a WIDE area of research.\n• Malloc is generally more complex or specialized these days than the options\nhere.\n• Or some kind of hybrid, as the need arises.\n\n• The Linux kernel makes use of a Slab Allocator\n• https://en.wikipedia.org/wiki/Slab_allocation\n\n• Modern C (glibc) uses a hybrid malloc:\n• https://www.gnu.org/software/libc/manual/html_node/The-GNU-Allocator.html\n\n• Professor Knuth has written about several classic algorithms.\n• Buddy Allocation comes from the 60s. Groovy.\n52\n\n\f", "label": [[354, 368, "Concept"], [2224, 2237, "Concept"], [3897, 3910, "Concept"], [3998, 4010, "Concept"], [8829, 8842, "Concept"], [9633, 9646, "Concept"], [9786, 9795, "Concept"], [9924, 9932, "Concept"], [10043, 10051, "Concept"], [10155, 10168, "Concept"], [12373, 12382, "Concept"], [12940, 12948, "Concept"], [12950, 12958, "Concept"], [13306, 13314, "Concept"], [13962, 13970, "Concept"], [13993, 14001, "Concept"], [14020, 14029, "Concept"], [14150, 14158, "Concept"], [14615, 14623, "Concept"], [14626, 14633, "Concept"], [14711, 14724, "Concept"], [14834, 14847, "Concept"], [14973, 14986, "Concept"], [15076, 15084, "Concept"], [15087, 15095, "Concept"], [15681, 15689, "Concept"], [16154, 16164, "Concept"], [16411, 16426, "Concept"], [16534, 16556, "Concept"], [16678, 16700, "Concept"], [17297, 17307, "Concept"], [17333, 17343, "Concept"], [17429, 17437, "Concept"], [17480, 17488, "Concept"], [17669, 17682, "Concept"], [18213, 18231, "Concept"], [18461, 18465, "Concept"], [18468, 18482, "Concept"]], "Comments": []}